export const DEFAULT_ME: MeInfo = {
  title: "README.md",
  body: `안녕하세요<br/> 저는 서비스의 속도와 안정성을 높이는 데 큰 보람을 느끼는 개발자 황재민입니다. 다양한 흥미로운 프로젝트와 기술을 시도하며, 지속적으로 성장하고자 노력하고 있습니다.
  제 포트폴리오에는 다양한 프로젝트가 포함되어 있으며, 각 프로젝트에서는 후기 또는 개발 일지을 공유하고 있습니다. 이 과정을 통해 제가 어떻게 문제를 해결하고 배울 기술을 어떻게 접목하였는지 보여드리고 싶습니다.
  흥미롭게 보아주시면 감사하겠습니다!
  `,
  percent: 0,
};

export const DRIVING_FORCE_ME: MeInfo = {
  title: "추진력",
  body: `추진력은 저의 가장 큰 장점 중 하나입니다. 저의 깃 허브 상태에서 확인할 수 있듯이 
    개발을 다시 시작하면서, 공부와 프로젝트를 효과적으로 진행할 수 있도록 해준 원동력이 되었습니다. 
    4월부터 현재까지, 자바스크립트와 타입스크립트뿐만 아니라 러스트까지 배우며 다양한 언어의 기초를 다졌을 뿐만 아니라 
    여러 가지 라이브러리와 프레임워크를 익혔으며, 특히 각 언어에서 주로 사용되는 주요 도구들에 대한 이해를 깊게 할 수 있었습니다. 
    `,
  percent: 40,
};

export const RECORD_ME: MeInfo = {
  title: "기록",
  body: `
  저는 추진력이 빠른 편이지만, 일을 신속하게 처리한 후에 놓치는 부분이 많았던 단점이 있었습니다. 
  예를 들어, 구현하려던 목적과는 다른 기능을 개발하고 나서야 이를 깨닫는 경우가 종종 있었습니다. 그래서 이를 해결하기 위해 Notion 앱을 활용하여 일일 기록을 시작했습니다.
  자기전, 매일 제가 수행한 작업을 기록하며, 오늘의 목표와 진행한 내용이 일치하는지를 점검하는 시간을 가졌습니다. 이 과정을 통해 하루 했던 일을 정리하면서 내가 오늘 목표로 했던 주제와 다르지 않는가 검토하게 되었고 
  단점을 완화할 수 있는 계기가 되었습니다. 이러한 일일 정리는 한 달 단위로 발전하여, 한 달 동안의 작업을 정리하고 다음 달의 목표를 설정하는 방식으로 확장되었습니다. 
  이를 통해 성취감을 느끼고, 목표를 명확히 하여 더 효과적으로 업무를 진행할 수 있었습니다. 
  `,
  percent: 20,
};

export const PROBLEM_SOLVING_SKILL: MeInfo = {
  title: "문제 해결 능력",
  body: `문제를 해결할 때 저는 총 3가지 과정이 있습니다. 첫 번째는 공식 문서입니다. 예를 들어, Rust로 프로젝트를 진행할 때 한국어 자료가 부족하여, crate.io에 등록된 영문 문서를 참고했습니다. 
  보통 문제를 해결한 후에는 코드 주석에 관련 링크를 기록해 두는 편입니다.
  <br/>
  두 번째는 레퍼런스 책을 활용하는 것입니다. 언어를 배울 때는 항상 2개 이상의 책을 구매합니다. 
  타입스크립트의 경우, "타입스크립트 프로그래밍"과 "이펙티브 타입스크립트"를, 러스트는 "러스트 프로그래밍 공식 가이드"와 "이펙티브 러스트" 두 권씩 소장하고 있습니다. 
  이러한 레퍼런스 책을 통해 코드, 문법, 로직 등을 검토하며 문제를 해결합니다.
  <br/>
  세 번째는 주로 프레임워크나 라이브러리 관련 문제를 해결할 때 스택오버플로우와 같은 사이트를 활용합니다. 
  문제를 검색할 때는 투표 수가 높은 답변을 우선적으로 확인하며, 주로 발생하는 오류나 에러를 해결하는 데 많은 도움을 받습니다.`,
  percent: 20,
};

export const PLANNING_SKILL: MeInfo = {
  title: "계획적",
  body: `저의 하루아침은 시작하면 캘린더를 켜, 시간표와 하루의 목표를 정하는 것입니다. 
  처음에 캘린더 작성을 시작했을 때는 내용이 구체적이지 않고 넓은 의미로 시간표를 잡았지만, 
  지금에 와서는 구체적인 목표 1~2개와 오전, 오후, 저녁 시간대에 무엇을 할지 구체적으로 목표를 설정하고 이행하고 있습니다. 
  하루하루 작성한 계획과 목표를 이행하니 꾸준함이 생기고, 이것이 프로젝트를 만들고 공부를 할 수 있던 원동력이 되었습니다.`,
  percent: 20,
};
